dennisppaul/klangstrom-arduino/stm32/variants/KLST_SHEEP/variant_KLST_SHEEP.h
#define NUM_DIGITAL_PINS        82
#define NUM_DUALPAD_PINS        2
#define NUM_ANALOG_INPUTS       16

/*
// On-board LED pin number
#ifndef LED_BUILTIN
  #define LED_BUILTIN           PNUM_NOT_DEFINED
#endif

// On-board user button
#ifndef USER_BTN
  #define USER_BTN              PNUM_NOT_DEFINED
#endif

// SPI definitions
#ifndef PIN_SPI_SS
  #define PIN_SPI_SS            PA4
#endif
#ifndef PIN_SPI_SS1
  #define PIN_SPI_SS1           PA15
#endif
#ifndef PIN_SPI_SS2
  #define PIN_SPI_SS2           PNUM_NOT_DEFINED
#endif
#ifndef PIN_SPI_SS3
  #define PIN_SPI_SS3           PNUM_NOT_DEFINED
#endif
#ifndef PIN_SPI_MOSI
  #define PIN_SPI_MOSI          PA7
#endif
#ifndef PIN_SPI_MISO
  #define PIN_SPI_MISO          PA6
#endif
#ifndef PIN_SPI_SCK
  #define PIN_SPI_SCK           PA5
#endif

// I2C definitions
#ifndef PIN_WIRE_SDA
  #define PIN_WIRE_SDA          PB7
#endif
#ifndef PIN_WIRE_SCL
  #define PIN_WIRE_SCL          PB6
#endif

// Timer Definitions
// Use TIM6/TIM7 when possible as servo and tone don't need GPIO output pin
#ifndef TIMER_TONE
  #define TIMER_TONE            TIM6
#endif
#ifndef TIMER_SERVO
  #define TIMER_SERVO           TIM7
#endif

// UART Definitions
#ifndef SERIAL_UART_INSTANCE
  #define SERIAL_UART_INSTANCE  4
#endif

// Default pin used for generic 'Serial' instance
// Mandatory for Firmata
#ifndef PIN_SERIAL_RX
  #define PIN_SERIAL_RX         PA1
#endif
#ifndef PIN_SERIAL_TX
  #define PIN_SERIAL_TX         PA0
#endif

// Extra HAL modules
#if !defined(HAL_DAC_MODULE_DISABLED)
  #define HAL_DAC_MODULE_ENABLED
#endif
#if !defined(HAL_ETH_MODULE_DISABLED)
  #define HAL_ETH_MODULE_ENABLED
#endif
#if !defined(HAL_QSPI_MODULE_DISABLED)
  #define HAL_QSPI_MODULE_ENABLED
#endif
#if !defined(HAL_SD_MODULE_DISABLED)
  #define HAL_SD_MODULE_ENABLED
#endif
*/

/*----------------------------------------------------------------------------
 *        Arduino objects - C++ only
 *----------------------------------------------------------------------------*/

#ifdef __cplusplus
  // These serial port names are intended to allow libraries and architecture-neutral
  // sketches to automatically default to the correct port name for a particular type
  // of use.  For example, a GPS module would normally connect to SERIAL_PORT_HARDWARE_OPEN,
  // the first hardware serial port whose RX/TX pins are not dedicated to another use.
  //
  // SERIAL_PORT_MONITOR        Port which normally prints to the Arduino Serial Monitor
  //
  // SERIAL_PORT_USBVIRTUAL     Port which is USB virtual serial
  //
  // SERIAL_PORT_LINUXBRIDGE    Port which connects to a Linux system via Bridge library
  //
  // SERIAL_PORT_HARDWARE       Hardware serial port, physical RX & TX pins.
  //
  // SERIAL_PORT_HARDWARE_OPEN  Hardware serial ports which are open for use.  Their RX & TX
  //                            pins are NOT connected to anything by default.
  #ifndef SERIAL_PORT_MONITOR
    #define SERIAL_PORT_MONITOR   Serial
  #endif
  #ifndef SERIAL_PORT_HARDWARE
    #define SERIAL_PORT_HARDWARE  Serial
  #endif
#endif

/* -------------------------------------------------------------------------- */
/* --- KLST ----------------------------------------------------------------- */
/* --- PIN MAP -------------------------------------------------------------- */
/* -------------------------------------------------------------------------- */

#define PC2                             PC2_C
#define PC3                             PC3_C

#define ADC_00                          PC4
#define ADC_01                          PC5
#define AUDIOCODEC_I2C_SCL              PB6
#define AUDIOCODEC_I2C_SDA              PB7
#define AUDIOCODEC_SAI1_FS_A            PE4
#define AUDIOCODEC_SAI1_MCLK_A          PE2
#define AUDIOCODEC_SAI1_SCK_A           PE5
#define AUDIOCODEC_SAI1_SD_A            PE6
#define AUDIOCODEC_SAI1_SD_B            PE3
#define BUTTON_PRG                      PB9
#define DAC_00                          PA4
#define DAC_01                          PA5
#define ENCODER_00_A                    PA0
#define ENCODER_00_B                    PA1
#define ENCODER_00_BUTTON               PA3
#define ENCODER_01_A                    PA8
#define ENCODER_01_B                    PA9
#define ENCODER_01_BUTTON               PA10
#define GPIO_00                         PD7
#define GPIO_01                         PD4
#define GPIO_02                         PD3
#define GPIO_03                         PD2
#define GPIO_04                         PD11
#define GPIO_05                         PD10
#define GPIO_06                         PD9
#define GPIO_07                         PD8
#define GPIO_08                         PE15
#define GPIO_09                         PE10
#define GPIO_10                         PE9
#define GPIO_11                         PB2
#define GPIO_12                         PC0
#define GPIO_13                         PC15
#define GPIO_14                         PC14
#define GPIO_15                         PC13
#define I2C_USR_SCL                     PB10
#define I2C_USR_SDA                     PB11
#define LED_00                          PB8
#define LED_01                          PB5
#define LED_02                          PB4
#define LED_03                          PC9
#define LED_04                          PC8
#define LED_05                          PC7
#define LED_06                          PC6
#define LED_07                          PD15
#define LED_08                          PD14
#define LED_09                          PD13
#define LED_10                          PD12
#define LED_11                          PB1
#define LED_12                          PB0
#define LED_13                          PA7
#define LED_14                          PA6
#define LED_15                          PA2
#define SD_CARD_CS                      PB12
#define SD_CARD_MISO                    PC2
#define SD_CARD_MOSI                    PC3
#define SD_CARD_SCK                     PB13
#define SDCARD_CARD_DETECT              PC1
#define SERIAL_00_RX                    PE7
#define SERIAL_00_TX                    PE8
#define SERIAL_01_RX                    PE0
#define SERIAL_01_TX                    PE1
#define SERIAL_DEBUG_RX                 PD6
#define SERIAL_DEBUG_TX                 PD5
#define SPI_DISPLAY_CS                  PA15
#define SPI_DISPLAY_MISO                PC11
#define SPI_DISPLAY_MOSI                PC12
#define SPI_DISPLAY_REGISTER_SELECT     PD0
#define SPI_DISPLAY_RESET               PD1
#define SPI_DISPLAY_SCK                 PC10
#define SPI_USR_CS                      PE11
#define SPI_USR_MISO                    PE13
#define SPI_USR_MOSI                    PE14
#define SPI_USR_SCK                     PE12
#define SWD_SWCLK                       PA14
#define SWD_SWDIO                       PA13
#define SWD_SWO                         PB3
#define USB_DEVICE_DM                   PA11
#define USB_DEVICE_DP                   PA12
#define USB_HOST_DM                     PB14
#define USB_HOST_DP                     PB15

