dennisppaul/klangstrom-arduino/stm32/variants/KLST_SHEEP/variant_KLST_SHEEP.h
/* -------------------------------------------------------------------------- */
/* --- KLST ----------------------------------------------------------------- */
/* --- HAL ------------------------------------------------------------------- */
/* -------------------------------------------------------------------------- */

#define D_CACHE_DISABLED

#define HAL_MODULE_ENABLED

#if !defined(HAL_ADC_MODULE_DISABLED)
  #define HAL_ADC_MODULE_ENABLED
#endif
#if !defined(HAL_DAC_MODULE_DISABLED)
  #define HAL_DAC_MODULE_ENABLED
#endif
#ifndef HAL_SAI_MODULE_ENABLED
#define HAL_SAI_MODULE_ENABLED
#endif
#if !defined(HAL_SD_MODULE_DISABLED)
  #define HAL_SD_MODULE_ENABLED
#endif
#ifndef HAL_SPI_MODULE_ENABLED
#define HAL_SPI_MODULE_ENABLED
#endif
#ifndef HAL_TIM_MODULE_ENABLED
#define HAL_TIM_MODULE_ENABLED
#endif
#ifndef HAL_UART_MODULE_ENABLED
#define HAL_UART_MODULE_ENABLED
#endif
#ifndef HAL_PCD_MODULE_ENABLED
#define HAL_PCD_MODULE_ENABLED
#endif
#ifndef HAL_HCD_MODULE_ENABLED
#define HAL_HCD_MODULE_ENABLED
#endif
#ifndef HAL_GPIO_MODULE_ENABLED
#define HAL_GPIO_MODULE_ENABLED
#endif
#ifndef HAL_DMA_MODULE_ENABLED
#define HAL_DMA_MODULE_ENABLED
#endif
#ifndef HAL_MDMA_MODULE_ENABLED
#define HAL_MDMA_MODULE_ENABLED
#endif
#ifndef HAL_RCC_MODULE_ENABLED
#define HAL_RCC_MODULE_ENABLED
#endif
#ifndef HAL_FLASH_MODULE_ENABLED
#define HAL_FLASH_MODULE_ENABLED
#endif
#ifndef HAL_EXTI_MODULE_ENABLED
#define HAL_EXTI_MODULE_ENABLED
#endif
#ifndef HAL_PWR_MODULE_ENABLED
#define HAL_PWR_MODULE_ENABLED
#endif
#ifndef HAL_I2C_MODULE_ENABLED
#define HAL_I2C_MODULE_ENABLED
#endif
#ifndef HAL_CORTEX_MODULE_ENABLED
#define HAL_CORTEX_MODULE_ENABLED
#endif
#ifndef HAL_HSEM_MODULE_ENABLED
#define HAL_HSEM_MODULE_ENABLED
#endif

#define HSE_VALUE               (16000000)
#define HSE_STARTUP_TIMEOUT     (100UL)
#define CSI_VALUE               (4000000UL)
#define HSI_VALUE               (64000000UL)
#define LSE_VALUE               (32768UL)
#define LSE_STARTUP_TIMEOUT     (5000UL)
#define LSI_VALUE               (32000UL)
#define EXTERNAL_CLOCK_VALUE    (12288000UL)

#undef USBD_VBUS_DETECTION_ENABLE

/* -------------------------------------------------------------------------- */
/* --- KLST ----------------------------------------------------------------- */
/* --- PERIPHERALS ---------------------------------------------------------- */
/* -------------------------------------------------------------------------- */

#define LED_BUILTIN         LED_00
#define USER_BTN            ENCODER_00_BUTTON
#define BUTTON_PROGRAMMER   BUTTON_PRG

/* --- U(S)ART -------------------------------------------------------------- */

#define ENABLE_HWSERIAL7
#define PIN_SERIAL7_RX      SERIAL_00_RX
#define PIN_SERIAL7_TX      SERIAL_00_TX
#define ENABLE_HWSERIAL8
#define PIN_SERIAL8_RX      SERIAL_01_RX
#define PIN_SERIAL8_TX      SERIAL_01_TX
#define ENABLE_HWSERIAL2
#define PIN_SERIAL2_RX      SERIAL_DEBUG_RX
#define PIN_SERIAL2_TX      SERIAL_DEBUG_TX

#ifndef SERIAL_UART_INSTANCE
  #define SERIAL_UART_INSTANCE  2
#endif

// Default pin used for generic 'Serial' instance
// Mandatory for Firmata
#ifndef PIN_SERIAL_RX
  #define PIN_SERIAL_RX     SERIAL_DEBUG_RX
#endif
#ifndef PIN_SERIAL_TX
  #define PIN_SERIAL_TX     SERIAL_DEBUG_TX
#endif

#define KLST_UART_BAUD      115200
#define KLST_SERIAL_00      Serial7
#define KLST_SERIAL_01      Serial8
#define SerialDebug         Serial
#define KLST_LOG            Serial

/* --- SPI ------------------------------------------------------------------ */

#ifndef PIN_SPI_SS
  #define PIN_SPI_SS        SD_CARD_CS
#endif
#ifndef PIN_SPI_SS1
  #define PIN_SPI_SS1       PNUM_NOT_DEFINED
#endif
#ifndef PIN_SPI_SS2
  #define PIN_SPI_SS2       PNUM_NOT_DEFINED
#endif
#ifndef PIN_SPI_SS3
  #define PIN_SPI_SS3       PNUM_NOT_DEFINED
#endif
#ifndef PIN_SPI_MOSI
  #define PIN_SPI_MOSI      SD_CARD_MOSI
#endif
#ifndef PIN_SPI_MISO
  #define PIN_SPI_MISO      SD_CARD_MISO
#endif
#ifndef PIN_SPI_SCK
  #define PIN_SPI_SCK       SD_CARD_SCK
#endif


/* --- I2C ------------------------------------------------------------------ */

#ifndef PIN_WIRE_SDA
  #define PIN_WIRE_SDA      I2C_USR_SDA
#endif
#ifndef PIN_WIRE_SCL
  #define PIN_WIRE_SCL      I2C_USR_SCL
#endif

/* --- TIMER ---------------------------------------------------------------- */

#define ENCODER_00_TIMER    TIM1
#define ENCODER_01_TIMER    TIM2
#define KLST_BEAT_TIMER     TIM6
#define KLST_BUTTON_PRG_IT  TIM17

#ifndef TIMER_TONE
  #define TIMER_TONE        TIM12
#endif
#ifndef TIMER_SERVO
  #define TIMER_SERVO       TIM7
#endif

/* -------------------------------------------------------------------------- */
